INSERT INTO echo_stream.genres (name,description,create_time) VALUES
	 ('Pop','流行音乐是一种广泛的音乐风格，主要面向大众市场，通常具有易记的旋律和现代制作技术。','2024-08-26 17:10:10.312920'),
	 ('Rock','摇滚乐起源于20世纪50年代，融合了布鲁斯、乡村音乐等多种元素，以其强烈的节奏和电吉他独奏著称。','2024-08-26 17:10:10.312920'),
	 ('Electronic','电子音乐是利用电子设备制作的音乐，包括各种子流派如House、Techno等。','2024-08-26 17:10:10.312920'),
	 ('Hip Hop/Rap','嘻哈文化的一部分，以韵律和押韵的说唱为主要表现形式。','2024-08-26 17:10:10.312920'),
	 ('Country','起源于美国南部的传统音乐形式，常使用吉他、班卓琴等乐器。','2024-08-26 17:10:10.312920'),
	 ('R&B/Soul','节奏蓝调（R&B）与灵魂乐（Soul）的结合，强调情感表达和节奏感。','2024-08-26 17:10:10.312920'),
	 ('Classical','古典音乐是指西方传统的艺术音乐，通常由管弦乐队演奏。','2024-08-26 17:10:10.312920'),
	 ('Jazz','爵士乐起源于20世纪初的美国，以其即兴演奏和复杂的和声著称。','2024-08-26 17:10:10.312920'),
	 ('Blues','蓝调音乐源自非洲裔美国人社区，特点是重复的和弦结构和即兴演奏。','2024-08-26 17:10:10.312920'),
	 ('Metal','重金属音乐是一种摇滚乐的子流派，以其强烈的节奏和重型吉他演奏闻名。','2024-08-26 17:10:10.312920');
INSERT INTO echo_stream.genres (name,description,create_time) VALUES
	 ('Folk','民谣音乐是一种以故事讲述为主的音乐形式，通常使用简单的乐器伴奏。','2024-08-26 17:10:10.312920'),
	 ('World Music','世界音乐涵盖了不同国家和文化的传统音乐形式。','2024-08-26 17:10:10.312920'),
	 ('Latin','拉丁音乐起源于拉丁美洲和加勒比地区，以其独特的节奏和舞蹈性著称。','2024-08-26 17:10:10.312920'),
	 ('New Age','新世纪音乐通常没有传统音乐结构，旨在创造一种放松和平静的氛围。','2024-08-26 17:10:10.312920');
